Repository: cowegis/contao-geocoder
Catalog: src/Resources/contao/languages/*/*_cowegis_geocoder_provider.xlf
Languages: de

# tl_cowegis_geocoder_provider.title_legend
source: Title
de: Titel

# tl_cowegis_geocoder_provider.config_legend
source: Configuration
de: Konfiguration

# tl_cowegis_geocoder_provider.cache_legend
source: Caching
de: Cache

# tl_cowegis_geocoder_provider.title.0
source: Title
de: Titel

# tl_cowegis_geocoder_provider.title.1
source: Insert a title which is used in the Contao backend.
de: Geben Sie den Titel des Services an, der im Contao Backend verwendet wird.

# tl_cowegis_geocoder_provider.new.0
source: Create provider
de: Service anliegen

# tl_cowegis_geocoder_provider.new.1
source: Create new provider configuration
de: Neuen Geokodierungs-Service konfigurieren

# tl_cowegis_geocoder_provider.edit.0
source: Edit provider
de: Service bearbeiten

# tl_cowegis_geocoder_provider.edit.1
source: Edit provider ID "%s"
de: Geokodierungs-Service ID "%s" bearbeiten

# tl_cowegis_geocoder_provider.delete.0
source: Delete provider
de: Service löschen

# tl_cowegis_geocoder_provider.delete.1
source: Delete provider ID "%s"
de: Geokodierungs-Service ID "%s" löschen

# tl_cowegis_geocoder_provider.copy.0
source: Copy provider
de: Service kopieren

# tl_cowegis_geocoder_provider.copy.1
source: Copy provider ID "%s"
de: Geokodierungs-Service ID "%s" kopieren

# tl_cowegis_geocoder_provider.show.0
source: Show provider details
de: Service Details anzeigen

# tl_cowegis_geocoder_provider.show.1
source: Show provider ID "%s" details
de: Details Geokodierungs-Service ID "%s" anzeigen

# tl_cowegis_geocoder_provider.type.0
source: Type
de: Typ

# tl_cowegis_geocoder_provider.type.1
source: Please select the type of the provider.
de: Bitte wählen Sie den Typ des Services aus.

# tl_cowegis_geocoder_provider.isDefault.0
source: Default
de: Standard

# tl_cowegis_geocoder_provider.isDefault.1
source: Use this provider as default provider.
de: Diesen Service als Standard verwenden.

# tl_cowegis_geocoder_provider.cache.0
source: Cache results
de: Ergebnisse cachen

# tl_cowegis_geocoder_provider.cache.1
source: Cache geocode results to reduce API requests.
de: Ergebnisse der Geokodierungs-Service cachen um API Abfragen zu reduzieren.

# tl_cowegis_geocoder_provider.cache_ttl.0
source: Cache lifetime
de: Cache-Dauer

# tl_cowegis_geocoder_provider.cache_ttl.1
source: Cache lifetime in seconds. 0 means deactivated.
de: Cache-Dauer in Sekunden. 0 bedeutet deaktiviert.

# tl_cowegis_geocoder_provider.nominatim_root_url.0
source: Nominatim root url
de: Nominatim Wurzel-Url

# tl_cowegis_geocoder_provider.nominatim_country_codes.0
source: Nominatim country codes
de: Nominatim Länder-Code

# tl_cowegis_geocoder_provider.nominatim_country_codes.1
source: Limits the search to a specific country or a list of comma separated countries. Country codes must be in ISO 3166-1 alpha2.
de: Begrenzt die Suchergebnisse auf ein spezifisches Land oder einer kommaseparierten Liste von Ländern. Die Länder-Codes müssen ISO 3166-1 alpha2 kompatibel sein.

# tl_cowegis_geocoder_provider.google_api_key.0
source: Google API key
de: Google API-Schlüssel

# tl_cowegis_geocoder_provider.google_api_key.1
source: Please insert your Google API key.
de: Bitte geben Sie den Google API-Schlüssel an

# tl_cowegis_geocoder_provider.google_region.1
source: Define the region information passed to Google Maps API.
de: Definieren Sie die Region, die an die Google Maps API weitergegeben werden soll.

# tl_cowegis_geocoder_provider.chain_providers.0
source: Providers
de: Services

# tl_cowegis_geocoder_provider.chain_providers.1
source: Choose a list of providers which should be used as a chain.
de: Bitte wählen Sie eine Liste von Geokodierungs-Services aus, die nacheinander überprüft werden sollen.

# tl_cowegis_geocoder_provider.types.nominatim.0
source: Nomimatim
de: Nominatim

# tl_cowegis_geocoder_provider.types.nominatim.1
source: Nominatim geocoding service
de: Nominatim Geokodierungs-Service

# tl_cowegis_geocoder_provider.types.google_maps.1
source: Google Maps Geocoding API
de: Google Maps Geokodierungs API

# tl_cowegis_geocoder_provider.types.chain.0
source: Chain
de: Mehrere

# tl_cowegis_geocoder_provider.types.chain.1
source: Chain of different geocoder providers
de: Kette von verschiedenen Geokodierungs-Services.
